Revit 2024 API
VertexPair Class
 Indices of a pair of vertices in two CurveLoops(one vertex in each loop).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class VertexPair : IDisposable
Visual Basic
Public Class VertexPair _
	Implements IDisposable
Visual C++
public ref class VertexPair : IDisposable
Remarks
 A vertex is specified by the index in the CurveLoop of the curve having that vertex as its start point. Indexes start at 0.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.VertexPair
See Also
VertexPair Members
Autodesk.Revit.DB Namespace